/**
 * 各项目自行约定相关的产量扩展属性信息
 * 
 * 结合 YT.Format.fmtNsType(key, type) 使用
 * 
 * 格式如下
 */
NS.ACCT_TYPE = {
	SA : "01",// 借记卡
	CC : "02",// 信用卡
	ELE : "04",// 电子账号
	OTH : "08"// 他行卡
};
NS.ACCT_TYPE_NAME = {
	"01" : "借记卡",// 借记卡
	"02" : "信用卡",// 信用卡
	"04" : "电子账号",// 电子账号
	"08" : "他行卡"// 他行卡
};
/**
 * 本行标识
 */
NS.SELF_BANK = {
	BANK_CODE : '308584000013',
	BANK_NAME : '招商银行'
}

/**
 * 账号状态
 */
NS.ACCT_STATUS = {
	"0" : '正常',
	"1" : '锁卡',
	"2" : '挂失'
}

/**
 * 图标颜色库
 */
NS.ECHART_COLORS = [ '#C1232B', '#B5C334', '#FCCE10', '#E87C25', '#27727B',
		'#FE8463', '#9BCA63', '#FAD860', '#F3A43B', '#60C0DD', '#D7504B',
		'#C6E579', '#F4E001', '#F0805A', '#26C0C0' ];